import { Product } from './types';

export const products = new Map<string, Product>([
    [
        'njkfh78901',
        {
            productId: 'njkfh78901',
            name: 'Sony WH-1000XM4',
            price: 23990,
            description:
                'Sony WH-1000XM4 являются одними из лучших наушников с активным шумоподавлением на рынке, обеспечивая исключительное качество звука и комфорта. Они оснащены новейшей технологией Noise Cancelling, которая эффективно блокирует внешние шумы, позволяя полностью погружаться в любимую музыку или подкасты. Модели WH-1000XM4 используют интеллектуальную систему адаптивного шумоподавления, которая автоматически регулируется в зависимости от окружающей среды и активности пользователя. Эти наушники поддерживают Bluetooth 5.0 для стабильного и быстрого соединения, а также технологию LDAC для воспроизведения высококачественного аудио. Удобные амбушюры из мягкого материала и регулируемое оголовье делают их идеальными для длительного ношения. Время работы на одном заряде достигает до 30 часов, что делает их отличным выбором для долгих поездок и путешествий. Кроме того, наушники оснащены функцией быстрой зарядки, которая позволяет получить до 5 часов воспроизведения всего за 10 минут зарядки.',
            rating: 4.8,
            totalComments: 1200,
        },
    ],
    [
        'mdf34ghj23',
        {
            productId: 'mdf34ghj23',
            name: 'Bose QuietComfort 45',
            price: 27990,
            description:
                'Bose QuietComfort 45 — это премиум-наушники, обеспечивающие исключительное качество звука и передовое активное шумоподавление. Они оснащены новыми динамиками, которые создают яркое и детализированное звучание, а также системой активного шумоподавления, которая эффективно блокирует внешние звуки и позволяет сосредоточиться на музыке или разговорах. Наушники имеют два режима активного шумоподавления: максимальный для полной изоляции и «Окружающий» для прослушивания окружающих звуков при необходимости. Комфортные амбушюры с мягким наполнителем и регулируемое оголовье гарантируют удобное ношение даже в течение длительного времени. Bose QuietComfort 45 поддерживают Bluetooth и NFC для удобного подключения к устройствам, а также имеют встроенный микрофон для качественных звонков. Время работы на одном заряде составляет до 24 часов, что позволяет использовать их в течение целого дня. Вдобавок, они поддерживают быструю зарядку, которая позволяет получить до 3 часов воспроизведения всего за 15 минут зарядки.',
            rating: 4.7,
            totalComments: 900,
        },
    ],
    [
        'klmfdg5678',
        {
            productId: 'klmfdg5678',
            name: 'Apple AirPods Pro',
            price: 18990,
            description:
                'Apple AirPods Pro представляют собой высококачественные беспроводные наушники с активным шумоподавлением и режимом прозрачности. Они оснащены адаптивными амбушюрами, выполненными из мягкого силикона, которые обеспечивают удобную и надёжную посадку в ушах. Активное шумоподавление позволяет полностью изолироваться от внешних шумов, создавая идеальные условия для прослушивания музыки, подкастов или звуковых книг. Режим прозрачности, с другой стороны, позволяет слышать окружающие звуки, когда это необходимо, обеспечивая безопасность и возможность общения. AirPods Pro поддерживают технологию H1 для быстрой и стабильной беспроводной связи и интеграцию с голосовыми помощниками Siri. Время работы на одном заряде составляет до 4.5 часов, а с зарядным кейсом — до 24 часов. Быстрая зарядка позволяет получить до 1 часа воспроизведения всего за 5 минут зарядки, что делает их удобными для использования в любых условиях.',
            rating: 4.9,
            totalComments: 2500,
        },
    ],
    [
        'pqwrej2345',
        {
            productId: 'pqwrej2345',
            name: 'Sennheiser Momentum 3 Wireless',
            price: 25990,
            description:
                'Sennheiser Momentum 3 Wireless — это наушники премиум-класса, которые предлагают выдающееся качество звука и передовое активное шумоподавление. Эти наушники оснащены технологией NoiseGard Hybrid, которая эффективно блокирует внешние звуки и позволяет сосредоточиться на музыке или голосовых вызовах. Momentum 3 Wireless имеют динамические драйверы, которые создают мощное и чистое звучание с богатым басом и чёткими высокими частотами. Они также поддерживают встроенные голосовые помощники и имеют интуитивно понятное управление для удобного изменения настроек и воспроизведения. Наушники выполнены в элегантном дизайне с качественными материалами, что обеспечивает долговечность и комфорт. Время работы на одном заряде составляет до 17 часов, а с зарядным кейсом — до 26 часов. Быстрая зарядка позволяет получить до 1.5 часов воспроизведения всего за 10 минут зарядки, что делает их отличным выбором для длительных поездок.',
            rating: 4.6,
            totalComments: 120,
        },
    ],
    [
        'jgfhg78945',
        {
            productId: 'jgfhg78945',
            name: 'Jabra Elite 85t',
            price: 16990,
            description:
                'Jabra Elite 85t — это беспроводные наушники с активным шумоподавлением и качественным звучанием. Эти наушники оснащены новейшей технологией активного шумоподавления, которая позволяет настраивать уровень подавления окружающих звуков в зависимости от предпочтений пользователя. Они имеют большие 12-мм динамики, которые обеспечивают богатое и глубокое звучание с чёткими высокими частотами и мощными басами. Elite 85t предлагают комфортную посадку благодаря силиконовым амбушюрам и эргономичному дизайну, что позволяет использовать их длительное время без дискомфорта. Время работы на одном заряде составляет до 5.5 часов, а с зарядным кейсом — до 25 часов. Быстрая зарядка позволяет получить до 1 часа воспроизведения всего за 15 минут зарядки. Наушники поддерживают голосовые помощники и имеют встроенный микрофон для качественных звонков.',
            rating: 4.4,
            totalComments: 504,
        },
    ],
    [
        'wqert56789',
        {
            productId: 'wqert56789',
            name: 'Bose Sport Earbuds',
            price: 9990,
            description:
                'Bose Sport Earbuds — это идеальный выбор для активных людей, которые ищут надёжные и качественные беспроводные наушники для тренировок. Эти наушники имеют водоотталкивающий дизайн и устойчивы к поту, что позволяет использовать их в любых условиях. Они оснащены технологией Bose StayHear Max, которая обеспечивает комфортное и надёжное прилегание в ушах, а также гарантирует отличное качество звука. Наушники имеют встроенные микрофоны для чётких звонков и поддержки голосовых команд. Время работы на одном заряде составляет до 5 часов, а с зарядным кейсом — до 15 часов, что позволяет использовать их на протяжении длительных тренировок и путешествий. Быстрая зарядка позволяет получить до 1.5 часов воспроизведения всего за 15 минут зарядки.',
            rating: 4.6,
            totalComments: 280,
        },
    ],
    [
        'lopiu12345',
        {
            productId: 'lopiu12345',
            name: 'Beats Studio Buds',
            price: 14990,
            description:
                'Beats Studio Buds — это беспроводные наушники, предлагающие активное шумоподавление и режим прозрачности в компактном и стильном корпусе. Они оснащены 8.2-мм динамиками, которые обеспечивают чёткое и мощное звучание с глубокими басами и ясными высокими частотами. Эти наушники имеют удобные силиконовые амбушюры, которые обеспечивают надёжное и комфортное прилегание в ушах, а также эффективное изолирование от внешних шумов. Время работы на одном заряде составляет до 8 часов, а с зарядным кейсом — до 24 часов. Быстрая зарядка позволяет получить до 1 часа воспроизведения всего за 5 минут зарядки. Beats Studio Buds также поддерживают интеграцию с голосовыми помощниками и имеют встроенные микрофоны для качественных звонков.',
            rating: 4.8,
            totalComments: 1256,
        },
    ],
    [
        'zxcvb78901',
        {
            productId: 'zxcvb78901',
            name: 'Samsung Galaxy Buds Pro',
            price: 14990,
            description:
                'Samsung Galaxy Buds Pro — это беспроводные наушники с активным шумоподавлением, которые обеспечивают выдающееся качество звука и комфортное ношение. Они оснащены двумя динамиками в каждом наушнике, которые создают насыщенное и детализированное звучание с глубокими басами и чёткими высокими частотами. Galaxy Buds Pro также предлагают режим прозрачности для того, чтобы слышать окружающие звуки, когда это необходимо. Эти наушники имеют водоотталкивающий дизайн, что делает их идеальными для использования во время тренировок и в дождливую погоду. Время работы на одном заряде составляет до 5 часов, а с зарядным кейсом — до 18 часов. Быстрая зарядка позволяет получить до 1 часа воспроизведения всего за 5 минут зарядки. Galaxy Buds Pro также поддерживают интеграцию с голосовыми помощниками и имеют встроенные микрофоны для качественных звонков.',
            rating: 4.7,
            totalComments: 1670,
        },
    ],
    [
        'yuiop56789',
        {
            productId: 'yuiop56789',
            name: 'JBL Live 660NC',
            price: 12990,
            description:
                'JBL Live 660NC — это наушники с активным шумоподавлением, которые предлагают отличное качество звука и комфортное ношение. Они оснащены 40-мм динамиками, которые обеспечивают глубокие басы и яркие высокие частоты для полного погружения в музыку. Наушники имеют функцию активного шумоподавления, которая позволяет блокировать внешние звуки и сосредоточиться на прослушивании. Время работы на одном заряде составляет до 50 часов, что делает их идеальным выбором для длительных поездок и прослушиваний. Поддержка голосовых помощников и Bluetooth 5.0 обеспечивает удобное управление и стабильное соединение. Быстрая зарядка позволяет получить до 4 часов работы всего за 10 минут зарядки. JBL Live 660NC также поддерживают интеграцию с голосовыми помощниками и имеют встроенные микрофоны для качественных звонков.',
            rating: 4.6,
            totalComments: 1106,
        },
    ],
]);
